app/controllers/balloons_controller.rb

SELECT COUNT(*) FROM "balloons"
SELECT "balloons".* FROM "balloons" WHERE "balloons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    clear()
    ball = Balloon.pluck(:id)
    if ball.size < 5 then
      bchoice = ball
    else
      bchoice = ball.to_a.sample(5)
    end
    @b = Balloon.find(bchoice)

INSERT INTO "balloons" ("user_id", "title", "content", "date", "paperType", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def new
    @balloon = current_user.balloons.new(
        user_id: current_user.id,
        title: 'tmp',
        content: 'tmp',
        date: DateTime.current,
        paperType: params[:paperType]
    )
    @balloon.save